Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ChatBot</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IdInstance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>webhookUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтмечатьВходящиеСообщенияПрочитанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеСообщенияИФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьСтатусыОтправленныхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленииОСостоянииТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленияОСостоянииАккаунта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>apiUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>mediaUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыставлитьСтатусВСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВебХука</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot/Forms/ЧатБот/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ApiToken = Константы.iga_ApiToken.Получить();
	Объект.apiUrl = Константы.iga_apiUrl.Получить();
	Объект.IdInstance = Константы.iga_IdInstance.Получить();
	Объект.mediaUrl = Константы.iga_mediaUrl.Получить();
	ВремяЖизниСеансаОбработчика = Константы.iga_ВремяЖизниОбработчика.Получить();
	
	ПодготовитьНастройки();
	
	ПроверкаЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ЗначениеЗаполнено(Объект.ApiToken) И ЗначениеЗаполнено(Объект.IdInstance) Тогда
	//	ОбновитьСтатусСервиса();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ВыбранноеЗначение.ИмяФормы = "ПомощникПодключения" Тогда
			Объект.IdInstance = ВыбранноеЗначение.IdInstance;
			Объект.ApiToken   = ВыбранноеЗначение.ApiToken;
			Объект.apiUrl     = ВыбранноеЗначение.apiUrl;
			Объект.mediaUrl   = ВыбранноеЗначение.mediaUrl;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовКомандФормы

&НаКлиенте
Процедура ОтмечатьВходящиеСообщенияПрочитаннымиПриИзменении(Элемент)
	ОтмечатьВходящиеСообщенияПрочитаннымиПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ОбновитьСтатусСервиса();
	Элементы.СтатусПроверки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ОбновитьСтатусСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПомощник(Команда)
	
	ОткрытьФормуОбработки("ПомощникПодключения");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьБота(Команда)
	
	Элементы.ГруппаНеЗаполненыНастройки.Видимость = Ложь;
	Элементы.ГруппаНеСканированКод.Видимость = Ложь;
	Элементы.ГруппаНестандартныеНастройки.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ApiToken) И Не ЗначениеЗаполнено(Объект.IdInstance) Тогда
		Элементы.ГруппаНеЗаполненыНастройки.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбновитьСтатусСервиса();
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	
	Если Объект.webhookUrl <> ХостВебхуковПоУмолчанию()
		Или Не Объект.ПолучатьВходящиеСообщенияИФайлы 
		Или Объект.ПолучатьСтатусыОтправленныхСообщений 
		Или Объект.ПолучатьУведомленииОСостоянииТелефона
		Или Объект.ПолучатьУведомленияОСостоянииАккаунта Тогда
		
		Элементы.ГруппаНестандартныеНастройки.Видимость = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не все настройки настроены правильно. Проверьте инстанс.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Если СтатусСервиса Тогда
		ВыполнитьЗапускБота();
	Иначе
		Элементы.ГруппаНеСканированКод.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверкаЗапуска()
	Элементы.ЗапуститьБота.Пометка = Константы.iga_ЧатБотИспользуется.Получить();
	Если Элементы.ЗапуститьБота.Пометка Тогда
		Элементы.ЗапуститьБота.Заголовок = "Остановить бота";
		СтатусПолучениеСообщения = "Получение сообщений...";
		Элементы.ГруппаЗапущенЧатБот.Видимость = Истина;
		ЗапуститьБотаСервер();
		//ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьБота", 3, Истина);
	Иначе
		Элементы.ЗапуститьБота.Заголовок = "Запустить бота";
		СтатусПолучениеСообщения = "";
		Элементы.ГруппаЗапущенЧатБот.Видимость = Ложь;
		ЗапуститьБотаСервер(Ложь)
		//ОтключитьОбработчикОжидания("Подключаемый_ЗапуститьБота");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗапускБота()
	Элементы.ЗапуститьБота.Пометка = Не Элементы.ЗапуститьБота.Пометка;
	Если Элементы.ЗапуститьБота.Пометка Тогда
		Элементы.ЗапуститьБота.Заголовок = "Остановить бота";
		СтатусПолучениеСообщения = "Получение сообщений...";
		Элементы.ГруппаЗапущенЧатБот.Видимость = Истина;
		ЗапуститьБотаСервер();
		//ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьБота", 3, Истина);
	Иначе
		Элементы.ЗапуститьБота.Заголовок = "Запустить бота";
		СтатусПолучениеСообщения = "";
		Элементы.ГруппаЗапущенЧатБот.Видимость = Ложь;
		ЗапуститьБотаСервер(Ложь)
		//ОтключитьОбработчикОжидания("Подключаемый_ЗапуститьБота");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодготовитьНастройки()
	
	ЭтотОбъект.Заголовок = ОбработкаОбъект().ВерсияОбработки();
	Объект.ИнтервалОтправкиСообщений = 500;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьБота() Экспорт
	Попытка
		ЗапуститьБотаСервер();
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьБота", 3, Истина);
	Исключение
		Элементы.ЗапуститьБота.Заголовок = "Запустить бота";
		СтатусПолучениеСообщения = "";
		Элементы.ГруппаЗапущенЧатБот.Видимость = Ложь;
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтключитьОбработчикОжидания("Подключаемый_ЗапуститьБота");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьБотаСервер(Запуск = Истина)
	
	Если Запуск Тогда
		Константы.iga_ЧатБотИспользуется.Установить(Истина);
	Иначе
		Константы.iga_ЧатБотИспользуется.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусСервиса()
	
	Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтатусСервиса = ОбработкаОбъект().ПолучитьСтатусСервиса();
	
	Если СтатусСервиса Тогда
		НастройкиСервиса = ОбработкаОбъект().ПолучитьНастройкиАккаунта();

		Объект.ПолучатьВходящиеУведомления = ЗначениеЗаполнено(НастройкиСервиса.webhookUrl) И НастройкиСервиса.webhookUrl = ОбработкаОбъект().ХостВебхуковПоУмолчанию();
		Если НастройкиСервиса.webhookUrl = "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Внимамние! Вебхук не указан!";
			Сообщение.Сообщить();
		КонецЕсли;
		Объект.webhookUrl = НастройкиСервиса.webhookUrl;
		Объект.ПолучатьВходящиеСообщенияИФайлы = НастройкиСервиса.incomingWebhook = "yes";
		Объект.ПолучатьСтатусыОтправленныхСообщений = НастройкиСервиса.outgoingWebhook = "yes";
		Объект.ПолучатьУведомленииОСостоянииТелефона = НастройкиСервиса.deviceWebhook = "yes";
		Объект.ПолучатьУведомленияОСостоянииАккаунта = НастройкиСервиса.stateWebhook = "yes";
		Объект.ОтмечатьВходящиеСообщенияПрочитанными = НастройкиСервиса.markIncomingMessagesReaded = "yes";
		Объект.ИнтервалОтправкиСообщений = Макс(НастройкиСервиса.delaySendMessagesMilliseconds, Объект.ИнтервалОтправкиСообщений);
		Объект.ВыставлитьСтатусВСети = НастройкиСервиса.keepOnlineStatus = "yes";
		
		ЕстьНестадантныенастройки = Не (ЗначениеЗаполнено(НастройкиСервиса.webhookUrl) И НастройкиСервиса.webhookUrl = ОбработкаОбъект().ХостВебхуковПоУмолчанию());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтмечатьВходящиеСообщенияПрочитаннымиПриИзмененииСервер()
	
	НастройкиСохранены = ОбработкаОбъект().УстановитьНастройкуСервиса("markIncomingMessagesReaded", 
		? (Объект.ОтмечатьВходящиеСообщенияПрочитанными, "yes", "no"));
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	Элементы.Разделы.ТекущаяСтраница = Элементы.НастройкиВнешние;
КонецПроцедуры

Функция ХостВебхуковПоУмолчанию()
	
	Возврат ОбработкаОбъект().ХостВебхуковПоУмолчанию();
	
КонецФункции

#КонецОбласти

#Область Утилиты

&НаСервере
Функция ПолучитьТекстИзМакета(ИмяМакета)
	Об = ОбработкаОбъект();
	ОбластьМакета = Об.ПолучитьМакет(ИмяМакета);
	Возврат ОбластьМакета.ТекущаяОбласть.Текст;
КонецФункции

&НаСервере
Функция ОбработкаОбъект() 
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Функция ЭтоВнешняяОбработкаОтчет() Экспорт
	ПолноеИмяМетаданных = ОбработкаОбъект().Метаданные().ПолноеИмя();
	Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных) = Неопределено
КонецФункции

&НаКлиенте
Функция ОткрытьФормуОбработки(ИмяФормы)
	
	Если ЭтоВнешняяОбработкаОтчет() Тогда
		ИмяОткрФормы = "ВнешняяОбработка.iga_ChatBot.Форма." + ИмяФормы;
	Иначе
		ИмяОткрФормы = "Обработка.iga_ChatBot.Форма." + ИмяФормы;
	КонецЕсли;
		
	ОткрытьФорму(ИмяОткрФормы, Новый Структура("IdInstance,ApiToken,apiUrl,mediaUrl", Объект.IdInstance, Объект.ApiToken, Объект.apiUrl, Объект.mediaUrl), ЭтотОбъект,,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкуКонстанты(ИмяКонстанты, Настройка)
	
	Константы[ИмяКонстанты].Установить(Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура IdInstanceПриИзменении(Элемент)
	СохранитьНастройкуКонстанты("iga_IdInstance", Объект.IdInstance);
КонецПроцедуры

&НаКлиенте
Процедура ApiTokenПриИзменении(Элемент)
	СохранитьНастройкуКонстанты("iga_ApiToken", Объект.ApiToken);
КонецПроцедуры

&НаКлиенте
Процедура apiUrlПриИзменении(Элемент)
	СохранитьНастройкуКонстанты("iga_apiUrl", Объект.apiUrl);
КонецПроцедуры

&НаКлиенте
Процедура mediaUrlПриИзменении(Элемент)
	СохранитьНастройкуКонстанты("iga_mediaUrl", Объект.mediaUrl);
КонецПроцедуры

&НаКлиенте
Процедура ВремяЖизниСеансаОбработчикаПриИзменении(Элемент)
	СохранитьНастройкуКонстанты("iga_ВремяЖизниОбработчика", ВремяЖизниСеансаОбработчика);
КонецПроцедуры

&НаСервере
Процедура ПерезапускАккаунтаНаСервере()
	ОбработкаОбъект().ПерезапуститьАккаунт();
КонецПроцедуры

&НаКлиенте
Процедура ПерезапускАккаунта(Команда)
	ПерезапускАккаунтаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыставлитьСтатусВСетиПриИзмененииНаСервере()
	НастройкиСохранены = ОбработкаОбъект().УстановитьНастройкуСервиса("keepOnlineStatus", 
		? (Объект.ВыставлитьСтатусВСети, "yes", "no"));
КонецПроцедуры

&НаКлиенте
Процедура ВыставлитьСтатусВСетиПриИзменении(Элемент)
	ВыставлитьСтатусВСетиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнтервалОтправкиСообщенийПриИзмененииНаСервере()
	НастройкиСохранены = ОбработкаОбъект().УстановитьНастройкуСервиса("delaySendMessagesMilliseconds", 
		Объект.ИнтервалОтправкиСообщений);
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтправкиСообщенийПриИзменении(Элемент)
	ИнтервалОтправкиСообщенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтандартныеНастройкиИнстансаНаСервере()
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	Бот.УстановитьНастройкиСервисаПоДефолту();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройкиИнстанса(Команда)
	УстановитьСтандартныеНастройкиИнстансаНаСервере();
КонецПроцедуры

#КонецОбласти
